QUESTIONS = [
    {
        "id": 1,
        "text": "バットとボールは合計で110円です。バットはボールより100円高いです。では、ボールはいくらですか？",
        "unit": "円",
        "correct_answer": "5",
    },
    {
        "id": 2,
        "text": "5台の機械が5分で5個の製品を作るとしたら、100台の機械が100個の製品を作るには何分かかりますか？",
        "unit": "分",
        "correct_answer": "5",
    },
    {
        "id": 3,
        "text": "ある湖にスイレンの葉が浮かんでいます。スイレンの葉は毎日2倍の面積に増えます。48日で湖全体を覆い尽くすとしたら、湖の半分を覆うには何日かかりますか？",
        "unit": "日",
        "correct_answer": "47",
    },
    {
        "id": 4,
        "text": "もしジョンが1つの樽の水を6日で飲め、メアリーが1つの樽の水を12日で飲めるとしたら、2人が一緒に1つの樽の水を飲み切るには何日かかりますか？",
        "unit": "日",
        "correct_answer": "4",
    },
    {
        "id": 5,
        "text": "ジェリーはクラスで15番目に高い成績と、15番目に低い成績の両方を取りました。そのクラスには何人の生徒がいますか？",
        "unit": "人",
        "correct_answer": "29",
    },
    {
        "id": 6,
        "text": "ある男性が豚を60ドルで買い、70ドルで売り、それを80ドルで買い戻し、最終的に90ドルで売りました。彼はいくら儲けましたか？",
        "unit": "ドル",
        "correct_answer": "20",
    },
    {
        "id": 7,
        "text": "サイモンは2008年初頭のある日、8,000ドルを株式市場に投資することにしました。投資から6ヶ月後の7月17日、彼が購入した株は50%下落しました。幸運なことに、7月17日から10月17日にかけて、彼が購入した株は75%上昇しました。このとき、1.損益なし、2.儲かっている、3.損をしている、のどれか。（数字で回答）",
        "unit": "",
        "correct_answer": "3",
    },
    {
        "id": 8,
        "text": "あなたは徒競走で3位を走っています。2位の選手を追い抜いたとしたら、あなたは何位になりますか？",
        "unit": "位",
        "correct_answer": "2",
    },
    {
        "id": 9,
        "text": "ある農夫には15匹の羊がいましたが、「8匹を除いて」すべて死んでしまいました。何匹残っていますか？",
        "unit": "匹",
        "correct_answer": "8",
    },
    {
        "id": 10,
        "text": "深さ3フィート、幅3フィート、長さ3フィートの穴の中には、何立方フィートの土がありますか？",
        "unit": "立方フィート",
        "correct_answer": "0",
    },
]
